Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེང་ ཕྱིན་ཆད་ ཇི་སྲིད་ འཚོ འི་ བར་ དུ་ ཆོས་གོས་ དང་ །_ བསོད་སྙོམས་ དང་ །_ གཟིམས་ ཆ་ དང་ །_ སྙུན་ གྱི་ གསོས་ སྨན་ དང་ །_ ཡོ་བྱད་ དག་ དང་ །_ ཡོ་བྱད་ གཞན་ དང་ །_ གཞན་དག་ ལ་ སྤྱན་ འདྲེན་ ཏོ །_།
en: Henceforth, for as long as I live, I will treat you to religious robes, alms, bedding, medicines, utensils, other necessities, and much else.

source: དགེ་སློང་ གང་དག་ ཚེ་ དང་ ལྡན་པ འི་ རྗེས་སུ་ འབྲང་བ་ དེ་དག་ ཀྱང་ མགྲོན་ དུ་ གཉེར་ རོ །_།
en: I will also invite as guests the monks that are your venerable followers.’

source: དེ་ནས་ དགེ་སློང་ ཡེ་ཤེས་ མཆོག་ གིས་ ཚོང་དཔོན་ གྱི་ བུ་ དོན་ གྱི་ བློ་གྲོས་ ལ་ འདི་སྐད་ ཅེས་ སྨྲས་ [160a] སོ །_།
en: $1287 “The monk Jñānottama replied to the merchant’s son Arthamati, [160.a]

source: ཁྱིམ་བདག་ ཁྱོད་ ཀྱིས་ སྨྲས་པ་ དེ་དག་ དགེ འོ །_།
en: ‘Householder, what you have said is virtuous!’

source: དེ་ནས་ ཚོང་དཔོན་ གྱི་ བུ་ དོན་ གྱི་ བླ་ གྲོས་ དགེ་སློང་ ཡེ་ཤེས་ མཆོག་ གི་ རྐང་པ་ ལ་ ཕྱག་ འཚལ་ ཏེ་ བསྐོར་བ་ བྱས་ ནས །_ |#| དགེ་སློང་ ཡེ་ཤེས་ མཆོག་ གི་ ཐད་ ནས་ སོང་ ངོ་ །_།
en: The merchant’s son Arthamati then bowed to the monk Jñānottama’s feet, circumambulated him, and departed from his company.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ འོག་ ཏུ་ དགེ་སློང་ ཡེ་ཤེས་ མཆོག་ ཚོང་དཔོན་ གྱི་ བུ་ གཞོན་ནུ་ དོན་ གྱི་ བློ་གྲོས་ ཀྱི་ ཁྱིམ་ དུ་ སོང་ ངོ་ །_།
en: $1288 “Śāradvatī­putra, subsequently the monk Jñānottama visited the house of the merchant’s son Arthamati.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ནས་ དགེ་སློང་ ཡེ་ཤེས་ མཆོག་ གིས་ ཚོང་དཔོན་ གྱི་ བུ་ གཞོན་ནུ་ དོན་ གྱི་ བློ་གྲོས་ ཀྱི་ ཕ་མ་ དག་ དང་ །_ བུ་ དང་ །_ ཆུང་མ་ དང་ །_ བྲན་ ཕོ་ དང་ །_ བྲན་མོ་ དང་ །_ ལས་ བྱེད་པ་ དང་ །_ ཞོ་ཤས་འཚོ་བ་ དག་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ལ་ བཀོད་ དོ །_།
en: Śāradvatī­putra, the monk Jñānottama then established the parents, children, wives, male servants, female servants, workers, and day laborers of the merchant’s son Arthamati in unexcelled and perfect awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ཡང་ དགེ་བ འི་ རྩ་བ་ དེས་ བསྐལ་པ་ གྲངས་མེད་ པར་ ནམ་ཡང་ སངས་རྒྱས་ དང་ བྲལ་བ ར་ མ་ གྱུར །_ |#| ཆོས་ དང་ བྲལ་བ ར་ མ་ གྱུར །_ |#| དགེ་འདུན་ དང་ བྲལ་བ ར་ མ་ གྱུར །_ |#| དགེ་བ འི་ བཤེས་གཉེན་ དང་ བྲལ་བ ར་ མ་ གྱུར་ ཏོ །_།
en: Śāradvatī­putra, through that root of virtue he too was never separate from the Buddha, Dharma, Saṅgha, or spiritual friends for a countless eon.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ ཚོང་དཔོན་ གྱི་ བུ་ དོན་ གྱི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བྱུང་བ་ དེ་ གཞན་ ཞིག་ ཡིན་པ་ སྙམ་ དུ་ ཁྱོད་ སེམས་ ན་ དེ་ལྟ ར་ བལྟ་བ ར་ མི་ བྱ འོ །_།
en: $1289 “Śāradvatī­putra, if you think that the merchant’s son Arthamati was someone else, do not see it like that.

source: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_ |#| དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ ང་ ནི་ ཚོང་དཔོན་ གྱི་ བུ་ དོན་ གྱི་ བློ་གྲོས་ ཞེས་ བྱ་བ ར་ གྱུར་ ཏོ །_།
en: For at that time I was the merchant’s son Arthamati.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ ཚོང་དཔོན་ གྱི་ བུ་ གཞོན་ནུ་ དེ འི་ ཕ་ བྱུང་བ་ དེ་ གཞན་ ཞིག་ ཡིན་པ་ སྙམ་ དུ་ ཁྱོད་ སོམ་ཉི འམ །_ ཡིད་གཉིས་ ཟ་བ ར་ གྱུར་ ན་
en: Śāradvatī­putra, if you have any doubt or hesitation, thinking that the father of the merchant’s son Arthamati was someone else,

source: དེ་ལྟ ར་ བལྟ་བ ར་ མི་ བྱ འོ །_།
en: do not see it like that.

source: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་སྲུང་ དེ་ ནི་ ང འི་ ཕ ར་ གྱུར་ ཏོ །_།
en: For the thus-gone one Kāśyapa was my father then.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ སྲོག་ཆགས་ བྱེ་བ་ ཁྲག་ཁྲིག་ བྱུང་བ་ དེ་ གཞན་ ཡིན་པ་ སྙམ་ དུ་ སེམས་ ན །_
en: Śāradvatī­putra, if you think that the billions of beings present there were certain others,

source: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_ དེ་དག་ ཐམས་ཅད་ ནི་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ངེས་པ་ ཤ་སྟག་ གོ །_།
en: For they are all destined for unexcelled and perfect awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་དག་ ནི་ འཁོར་ འདི་ཉིད་ དུ་ ཡང་དག་ པར་ འདུས་པ ར་ གྱུར་ ཏེ །_ |#| དེ་དག་ ཀྱང་ ངས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: Śāradvatī­putra, they are assembled in this very retinue and have been predicted by me to reach unexcelled and perfect awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དགེ་སློང་ ཡེ་ཤེས་ མཆོག་ ནི་ དེ་ཉིད་ ཀྱི་ ཚེ་ ལེན་པ འི་ ལྷག་མ་ མེད་པ འི་ མྱ་ངན་ ལས་ འདས་པ འི་ དབྱིངས་ སུ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ [160b] འདས་ སོ །_།
en: $1290 “Śāradvatī­putra, the monk Jñānottama had attained at that very time complete nirvāṇa in the expanse of nirvāṇa where there is no remnant of clinging. [160.b]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གལ་ཏེ་ དགེ་སློང་ ཡེ་ཤེས་ མཆོག་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ ས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ ར་ མ་ གྱུར་ ན །_
en: Śāradvatī­putra, had the monk Jñānottama not attained complete nirvāṇa through the Hearer Vehicle,

source: དེས་ ཚོང་དཔོན་ གྱི་ བུ་ དོན་ གྱི་ བློ་གྲོས་ ལ་ ཆོས་ བསྟན་པ ས །_ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ ཇི་སྙེད་ ཡོད་པ་ དེ་སྙེད་ ཀྱིས་ དེ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ པར་ འགྱུར་ ཏེ |#| གང་དེ འི་ ཕ་མ་ དག་ དང་ །_ གཡོག་འཁོར་ ཐམས་ཅད་ ལ་ ཆོས་ བསྟན་པ ར་ བྱས་པ་ ལྟ་ཅི་ སྨོས །_
en: how could the merchant’s son Arthamati have fully awakened to unexcelled and perfect buddhahood through the massive heap of merit that came about through him teaching the Dharma, not to speak of his teaching of the Dharma to Arthamati’s parents and the entire circle of retainers?

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ གལ་ཏེ་ དགེ་སློང་ ཡེ་ཤེས་ མཆོག་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ ར་ མ་ གྱུར་ ན །_
en: Śāradvatī­putra, what if the monk Jñānottama had not reached complete nirvāṇa?

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ངས་ དགེ་སློང་ དེ་ ལ་ ལན་ དུ་ བྱ་བ་ བྱེད་ མི་ ནུས་པ ར་ འགྱུར་ རོ །_།
en: Śāradvatī­putra, I will not be able to repay that monk.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རྗེད་པ འམ །_ མཆོད་པ་ བྱས་ ཀྱང་ ང་ ལ་ ཆོས་ བསྟན་པ་ དེས་ དོན་ ཇི་ལྟ་བུ་ བྱས་པ་ དེ འི་ ལན་ དུ་ བྱ་བ་ བྱེད་ མི་ ནུས་པ ར་ འགྱུར་ རོ །_།
en: Śāradvatī­putra, even were I to honor or worship him, I would not be able to repay the precise favor that he did for me by teaching me the Dharma.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་ལྟ་བས་ན་ གང་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ དང་ ལྡན་པ འི་ གཏམ་ གྱིས་ རངས་པ ར་ བྱས་ ཤིང་ །_ ཡང་དག་ པར་ འཛིན་ དུ་ བཅུག་ ལ །_ ཡང་དག་ པར་ གཟེངས་ སྟོད་པ་ དེ་ ནི་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ དཔག་ ཏུ་ མེད་པ་ དང་ ལྡན་པ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, it is for this reason that whoever delights bodhisattvas with a Dharma sermon, causes them to retain it, and thus encourages them will be replete with an immeasurable heap of merit.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ ནི་ བྱ་བ་ དཔག་ ཏུ་ མེད་པ ས་ སེམས་ དེ་ སྐྱེད་པ ར་ བྱེད་ ཅིང་ །_ སེམས་ སྐྱེད་པ་ མངོན་པར་ སྒྲུབ་པ ར་ བྱེད་ ལ །_ སེམས་བསྐྱེད་པ་ དེ་ རབ་ཏུ་ གནས་པ ར་ བྱེད་ དོ །_།
en: $1291 “Śāradvatī­putra, through immeasurable deeds the bodhisattva engenders the mind of awakening, accomplishes that mind, and stabilizes it.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ འདི་ལྟ་སྟེ་ དཔེར་ན །_
en: Śāradvatī­putra, let me give an analogy:

source: རྒྱ་མཚོ་ ཆེན་པོ་ རབ་ཏུ་ གནས་པ་ ན་ ནོར་བུ་ རིན་པོ་ཆེ་ དེ་དག་ ནི་ རིན་ཐང་ གདབ་ ཏུ་ ཡོད་པ འམ །_ རིན་ཐང་ གདབ་ ཏུ་ མེད་པ་ ཡིན་པ་ དེ་ལྟ་ བུར་ ཤེས་པ ར་ བྱ་བ་ ཡིན་ ཞིང་ །_
en: When the ocean is steady, one can glean whether or not there are precious gems below that can be converted to wealth;#63

source: དེ་དག་ ཐམས་ཅད་ ཀྱང་ རྒྱ་མཚོ་ ཆེན་པོ་ ན །_ |#| རབ་ཏུ་ གནས་པ ར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ལ །_
en: one can know all the gems that are present in the ocean, and thus

source: དེ་དག་ ཐམས་ཅད་ རྒྱ་མཚོ་ ཆེན་པོ་ ནས །_ |#| རེ་བ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: one may hope to retrieve them from the ocean.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་བཞིན་ དུ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ ཆུབ་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ །_ རབ་ཏུ་ གནས་པ་ ན་ འཇིག་རྟེན་པ་ དང་ །_ འཇིག་རྟེན་ ལས་ འདས་པ་ དང་ །_ ཟག་པ་ དང་ བཅས་པ་ དང་ །_ ཟག་པ་ མེད་པ་ དང་ །_ ཁ་ན་མ་ཐོ་བ་ དང་ བཅས་པ་ དང་ །_ ཁ་ན་མ་ཐོ་བ་ མེད་པ་ དང་ །_ འདུས་བྱས་ དང་ །_ [161a] འདུས་མ་བྱས་ ཀྱི་ ཡེ་ཤེས་ ཇི་སྙེད་ ཡོད་པ་ ཐམས་ཅད་ ཀྱི་ སྣོད་ དེ་ ཡིན་པ ར་ འགྱུར་བ་ དང་ །_ |#| ཡེ་ཤེས་ ཡོངས་སུ་ གནས་པ ར་ བྱེད་པ ར་ འགྱུར་བ་ དང་ །_ དེར་ ཡེ་ཤེས་ ཐམས་ཅད་ རབ་ཏུ་ དབྱེ་བ་ ཐོབ་པ ར་ འགྱུར་བ་ དང་ །_ ཡེ་ཤེས་ ཐམས་ཅད་ ཀྱང་ དེ་ལས་ རབ་ཏུ་ སྐྱེ་བ ར་ འགྱུར་ རོ །_། |#| སྙམ་ དུ་ ཤེས་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: In the same way, Śāradvatī­putra, when the bodhisattva’s mind set on unexcelled and perfect awakening is steady, one can perceive that it is a receptacle of all the myriad kinds of wisdom that exist, whether mundane and supramundane, defiled and undefiled, reproachable and irreproachable, or compounded and uncompounded. [161.a] It will serve as the abode of wisdom, one will acquire therein the distinction between all wisdoms, and all wisdoms will arise from it.

source: རྒྱ་མཚོ་ ཆེན་པོ་ དེ་ཉིད་ རབ་ཏུ་ གནས་པ་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ །_ གང་ དུ་ ལུས་ཆེན་པོ་ རྒྱས་པ ར་ འགྱུར་བ་ དེ་ ནི་ འབྱུང་པོ་ ཆེན་པོ་ རྣམས་ ཀྱི་ གནས་ སུ་ འགྱུར་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: One should understand that when the ocean itself is steady, it becomes an abode of the great elements for the bodies that grow inside it.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ ཀྱི་ སེམས་ རབ་ཏུ་ གནས་པ་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ གང་ དུ་ ཡེ་ཤེས་ ཀྱི་ ལུས་ཆེན་པོ་ རྒྱས་པ ར་ འགྱུར་བ་ དང་ །_ དགེ་བ འི་ རྩ་བ འི་ ཚོགས་ཆེན་པོ་ མངོན་པར་ འཕེལ་བ ར་ འགྱུར་བ་ དེ་ ནི་ འབྱུང་པོ་ ཆེན་པོ་ མང་པོ་ གྲངས་མེད་པ འི་ གནས་ སུ་ འགྱུར་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: Likewise, Śāradvatī­putra, one should understand that when the mind of awakening is steadfast, it becomes an abode where unexcelled and perfect awakening, the great body of wisdom, grows, and where the many countless great elements of the great collection of roots of virtue develop.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ་ དཔེར་ན །_ |#| རྒྱ་མཚོ་ ཆེན་པོ་ དེ་ཉིད་ རབ་ཏུ་ གནས་པ་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ །_ གང་ དུ་ ཀླུ འི་ རྒྱལ་པོ་ ཆེན་པོ་ གནས་པ་ དེ་དག་ བྱ འི་ རྒྱལ་པོ་ ནམ་མཁའ་ ལྡིང་ དག་ གིས་ ཐུལ་བ ར་ དཀའ་བ ར་ འགྱུར་བ་ དང་ །_ དེ་དག་ རྒྱ་མཚོ་ ཆེན་པོ་ ནས་ བྱུང་ ནས་ |#| ཀྱང་ །_ |#| !གླིང་བཞི་པ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཆར་པ འི་ རྒྱུན་ ཆེན་པོ ས་ ཚིམ་པ ར་ བྱེད་པ་ དེ་ ནི །_ ཀླུ་ཆེན་པོ་ དག་ གིས་ གནས་ སུ་ འགྱུར་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: $1293 “Śāradvatī­putra, it should also be understood according to the following analogy: |#| When the ocean itself is steady, the great nāga kings dwelling there are difficult to overcome for the garuḍas, the kings of birds. |#| It is due to the great nāgas’#64 abode that they can emerge from the ocean and satiate the world of the four continents with great streams of rain.

source: ཤ་ར་ དྭ་ཏི འི་ བུ །_ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ ཡོངས་སུ་ གནས་པ་ ན །_
en: Likewise, Śāradvatī­putra, one should understand that when the mind of awakening engendered by the bodhisattva is steadfast,

source: དེ་ལས་ གཞན་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱིས་ དེ་ སངས་རྒྱས་ སུ་ གྱུར་ ནས །_ |#| སེམས་ཅན་ དཔག་ ཏུ་ མེད་པ འི་ གནས་ཆེན་པོ ར་ གྱུར་པ ར་ འགྱུར་ བ་ དང་ །_ ཆོས་ དེ་དག་ གི་ གནས་ ཀྱང་ བྱེད་པ ར་ འགྱུར་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཡུལ་ དེ འི་ གནས་ ཀྱང་ བྱེད་པ ར་ འགྱུར་བ་ དང་ །_
en: other bodhisattva great beings awaken to it, so that it serves as a great abode for countless beings. |#| It provides an abode for those qualities. |#| It also provides an abode for the objects of the buddhas.

source: དེ་ལས་ བདུད་ སྡིག་ཅན་ དག་ གིས་ ཕྱིར་ མི་ བསྒྱུར་བ ར་ འགྱུར་བ་ དང་ །_ ཐུལ་བ ར་ དཀའ་བ ར་ འགྱུར་བ་ དང་ །_ མི་ ནོན་པ ར་ འགྱུར་བ་ དང་ །_ [161b]
en: Wicked māras cannot divert beings from it, easily overcome it, or defeat it. [161.b]

source: གལ་ཏེ་ བདུད་ རྣམས་ ཀྱིས་ བདུད་ ཀྱི་ ལས་ བྱ འོ །_། |#| སྙམ་ ནས་ གནོད་པ འི་ སེམས་བསྐྱེད་ པར་ གྱུར་ ན །_ |#| དེ་དག་ གིས་ སེམས་བསྐྱེད་ མ་ ཐག་ ཁོ་ན |#| ར་ བདུད་ ཀྱིས་ བཅིང་བ་ ཐམས་ཅད་ ཐལ་བ ར་ རློག་པ ར་ བྱེད་པ ར་ འགྱུར་བ་ དང་ །_ བདུད་ ཀྱི་ སེམས་ ཐམས་ཅད་ ཐལ་ བ ར་ རློག་པ ར་ བྱེད་པ ར་ འགྱུར་བ ར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: If māras form ill intentions, thinking that they will enact the workings of the māras, then immediately upon forming such an intention, all the māras’ fetters and intentions will be utterly destroyed.

source: འདི་ལྟ་སྟེ །_ དཔེར་ན་
en: $1294 “It is also like the following analogy:

source: ཀླུ་ཆེན་པོ་ དེ་དག་ ནི་ རྒྱ་མཚོ་ ཆེན་པོ་ ལས་ ཕྱིར་ བསྒྱུར་བ ར་ དཀའ་བ་ ཡིན་ ཞིང་ །_
en: It is difficult to divert the great nāgas from the oceans.

source: དེ་དག་ རྒྱ་མཚོ་ ཆེན་པོ་ ནས་ མངོན་དུ་ བྱུང་ ནས །_ |#| གླིང་བཞི་པ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཆར་པ འི་ རྒྱུན་ ཆེན་པོ ས་ ཀུན་ དུ་ ཚིམ་པ ར་ བྱེད་ ཅིང་ །_ དེར་ སྨན་ དང་ །_ ནགས་ཚལ་ དག་ འཕེལ་བ་ དང་ །_ རྒྱས་པ་ དང་ །_ ཡངས་པ་ ཉིད་ དུ་ འགྱུར་བ་ དང་ །_ རྐང་གཉིས་པ་ དང་ །_ རྐང་བཞི་པ་ དག་ སྐོམ་པ་ རྒྱུན་ གཅོད་པ ར་ འགྱུར་བ་ དང་ །_ དེ འི་ འོག་ ཏུ་ ཡང་ རྒྱ་མཚོ་ ཆེན་ པོ ར་ འབབ་པ ར་ འགྱུར་བ་ ཡིན་ ནོ །_།
en: Having emerged from the oceans, they satiate the world of the four continents with great streams of rain, such that medicines and forests grow and flourish there, and the thirst of those with two legs and those with four is quenched. |#| Afterward, they once again plunge into the great oceans.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ དེ་ རབ་ཏུ་ གནས་པ་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཀླུ་ཆེན་པོ་ རྣམས་ ཀྱི་ གནས་ ཡིན་པ ར་ འགྱུར་བ་ དང་ །_ དེ་ ནས་ མངོན་དུ་ བྱུང་ ནས་ |#| ཀྱང་ །_ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ གྲོང་ དང་ །_ གྲོང་ཁྱེར་ དང་ །_ གྲོང་རྡལ་ དང་ །_ ལྗོངས་ དང་ །_ ཡུལ་འཁོར་ དང་ །_ རྒྱལ་པོ འི་ ཕོ་བྲང་ འཁོར་ དག་ ཏུ་ འདོད་ཆགས་ དང་ བྲལ་བ འི་ མཐའ་ ལས་ བྱུང་བ འི་ ཆོས་ ཀྱི་ ཆར་ པ་ མངོན་དུ་ འབེབས་པ ར་ བྱེད་པ་ དང་ །_ ཆོས་ ཀྱི་ ཆར་པ་ ཆེན་པོ་ འབེབས་པ ར་ འགྱུར་བ་ དང་ །_ སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ འི་ སྲེད་པ །_ འདོད་པ འི་ སྲེད་པ་ དང་ །_ གཟུགས་ ཀྱི་ སྲེད་པ་ དང་ །_ གཟུགས་ མེད་པ འི་ སྲེད་པ་ རབ་ཏུ་ ཞི་བ ར་ བྱེད་པ ར་ འགྱུར་ བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: Likewise, Śāradvatī­putra, one should understand that when the mind of awakening engendered by the bodhisattva is steadfast, it becomes an abode for the nāga-like bodhisattva great beings. |#| Having emerged from it, they bring down a rain of Dharma, a torrent of Dharma, whose source is the epitome of dispassion, upon the villages, towns, cities, countries, regions, and royal palaces throughout the trichiliocosm. |#| Thus they utterly quench the craving of innumerably countless beings—the craving of beings in the desire realms, the form realms, and the formless realms.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་
en: $1295 “Śāradvatī­putra, it is also like the following analogy:

source: རྒྱ་མཚོ་ ཆེན་པོ་ དེ་ཉིད་ ཡོངས་སུ་ གནས་པ་ ན །_
en: When the ocean itself is steadfast,

source: གླིང་བཞི་པ་ ན་ ཆུ་ ཀླུང་ ཆེན་པོ་ གང་དག་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ཐམས་ཅད་ འདིར་ འབབ་པ ར་ འགྱུར་བ་ དང་ །_ རྒྱ་མཚོ་ ཆེན་པོ་ ནི་ རིམ་གྱིས་ [162a] གཞོལ་བ འི་ ཕྱིར །_ རྒྱ་མཚོ་ ཆེན་པོ་ མ་གཏོགས་ པར་ དེ་དག་ གི་ གནས་ གཞན་ མེད་ དེ་དེ་ |#| དག་ ཐམས་ཅད་ རྒྱ་མཚོ་ ཆེན་པོ་ ག་ལ་བ་ དེར་ འབབ་ ཀྱང་ །_ རྒྱ་མཚོ་ ཆེན་པོ་ གང་བ འམ །_ བྲི་བ ར་ ཡང་ མི་འགྱུར་བ་ དང་ །_ རྒྱ་མཚོ་ ཆེན་པོ འི་ ཆོས་ཉིད་ གནས་ པ་ ཉིད་ ནི་ འདི་ ཡིན་ ཏེ
en: the myriad great rivers present throughout the four continents all flow into it. |#| Since the ocean gradually deepens, [162.a] they have no other destination but there and yet the ocean neither depletes nor fills despite the fact that they flow into it—it is the very nature of the ocean to accommodate them.

source: འདི་ལྟ་སྟེ །_ རྒྱ་མཚོ་ ཆེན་པོ འི་ ཆུ་ ནི་ ཆུ་ ཐ་དད་པ་ འབབ་པ་ ཡང་ ཡིན་ ལ །_ ཆུ་ གཅིག་པ་ ཡིན་པ ར་ ཡང་ འགྱུར་བ་ དང་ །_
en: Along the same lines, the water of the ocean is also the waters that flow into it separately—it is the same water.

source: འདི་ལྟ་སྟེ །_ |#| ལན་ཚྭ འི་ རོ ར་ རོ་ གཅིག་པ ར་ འགྱུར་བ ར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_། |#| ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ རབ་ཏུ་ གནས་པ་ ན །_
en: Just as one should understand that those waters will all obtain the same salty flavor, so too, Śāradvatī­putra, [one should understand that ]when the mind of awakening engendered by bodhisattvas is steadfast, [once they are fully awakened and have become awakened thus-gone ones themselves, it becomes a receptacle for all buddha qualities in their entirety and for the perpetual insight of all beings. As soon as those who harbor a variety of doubts about the Dharma see such bodhisattvas, they will instantly be free of doubts and, regardless of their former names, henceforth be known as ‘the Thus-Gone One’s hearer.’]

source: དེ་ སངས་རྒྱས་ ཉིད་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ ཉིད་ དང་ །_ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ ནས །_
en: [Just as one should understand that those waters will all obtain the same salty flavor, so too, Śāradvatī­putra, one should understand that when the mind of awakening engendered by bodhisattvas is steadfast, ]once they are fully awakened and have become awakened thus-gone ones themselves, [it becomes a receptacle for all buddha qualities in their entirety and for the perpetual insight of all beings. As soon as those who harbor a variety of doubts about the Dharma see such bodhisattvas, they will instantly be free of doubts and, regardless of their former names, henceforth be known as ‘the Thus-Gone One’s hearer.’]

source: སངས་རྒྱས་ ཀྱི་ ཆོས་ རྣམས་ ཡོངས་སུ་ རྫོགས་པ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཤེས་རབ་ རྒྱུན་ མི་འཆད་པ འི་ སྣོད་ དུ་ གྱུར་པ ར་ འགྱུར་བ་ དང་ །_ སེམས་ཅན་ གང་དག་ ཆོས་ ཀྱི་ ཐེ་ཚོམ་ སྣ་ཚོགས་ སྐྱེས་པ །_ དེ་དག་ གིས་ ཀྱང་ དེ་ མཐོང་ མ་ ཐག་ ཁོ་ན |#| ར་ ཐེ་ཚོམ་ དང་ བྲལ་བ ར་ འགྱུར་བ་ དང་ །_ མིང་ སྔ་མ་ དེ་དག་ ཀྱང་ །_ འདི་ལྟ་སྟེ །_ |#| དེ་བཞིན་ གཤེགས་པ འི་ ཉན་ཐོས་ ཞེས་ བྱ་བ ར་ མིང་ གཅིག་པ ར་ འབྱུང་བ་ དེ་ལྟ་ བུར་ རིག་པ ར་ བྱ་བ་ ཡིན་ ནོ །_།
en: [Just as one should understand that those waters will all obtain the same salty flavor, so too, Śāradvatī­putra, ]one should understand that [when the mind of awakening engendered by bodhisattvas is steadfast, once they are fully awakened and have become awakened thus-gone ones themselves, ]it becomes a receptacle for all buddha qualities in their entirety and for the perpetual insight of all beings. As soon as those who harbor a variety of doubts about the Dharma see such bodhisattvas, they will instantly be free of doubts and, regardless of their former names, henceforth be known as ‘the Thus-Gone One’s hearer.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ |#| རྒྱ་མཚོ་ ཆེན་པོ་ ནི་ ལན་ཚྭ འི་ རོ ར་ རོ་ གཅིག་པ་ ཡིན་ ནོ །_། |#| དེ་བཞིན་ དུ་ དེ འི་ ཉན་ཐོས་ ལེགས་པ་ ཁོ་ན ར་ རྣམ་པར་ གྲོལ་བ ས །_ རྣམ་པར་ གྲོལ་བ་ དེ་དག་ ཐམས་ཅད་ ནི་ འདི་ལྟ་སྟེ །_ |#| རྣམ་པར་ གྲོལ་བ འི་ རོ ར་ རོ་ གཅིག་པ ར་ འགྱུར་བ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, accordingly, just as the ocean has a singular salty taste, so will his excellent hearers be liberated, and thus liberated, all have the same taste of liberation.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ རྒྱ་མཚོ་ ཆེན་པོ་ དེ་ཉིད་ རབ་ཏུ་ གནས་པ་ ན །_
en: $1296 “Śāradvatī­putra, along the same lines, as an analogy, when the ocean itself is steadfast,

source: གཟོད་མ་ ཉིད་ ནས་ རིམ་གྱིས་ གཞོལ་བ ར་ གནས་ སོ །_།
en: it has from the very beginning been gradually deepening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གལ་ཏེ་ རྒྱ་མཚོ་ ཆེན་པོ་ གཟོད་མ་ ཉིད་ ནས་ བྱ་ སྐྱིབས་ སུ་ ཆགས་པ ར་ གྱུར་ ན །_
en: Since the ocean has formed from the very beginning with a descending floor,

source: རིན་པོ་ཆེ་ འདོད་པ འི་ མི་ རྣམས་ འཇུག་པ ར་ མི་ འགྱུར་ རོ །_།
en: people who want the gems it contains cannot access them.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རྒྱ་མཚོ་ ཆེན་པོ་ ནི་ ཟབ་པ་ ཉིད་ དང་ །_ ཆུ་ མཐའ་ཡས་པ ར་ རབ་ཏུ་ གནས་ སོ །_།
en: Śāradvatī­putra, the ocean is steadfast with limitless depth and water.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ །_ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ གནས་པ་ [162b] ན །_
en: Likewise, Śāradvatī­putra, when the mind of awakening engendered by the bodhisattva is steadfast, [162.b]

source: གཟོད་མ་ ཉིད་ ནས་ རིམ་གྱིས་ གཞོལ་བ ར་ རབ་ཏུ་ གནས་ ཤིང་ །_
en: it is steadfast from the very beginning as it continually deepens.

source: མཐའ་ཡས་པ་ ཉིད་ ཀྱིས་ རིམ་གྱིས་ འབབ་པ་ དང་ །_ རིམ་གྱིས་ བབ་པ ར་ ཀུན་ ནས་ གནས་ ལ་ ཟབ་པ་ ཉིད་ དུ་ རབ་ཏུ་ གནས་ སོ །_།
en: As it gradually deepens infinitely, it is steadfast to the very depths.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ རིམ་གྱིས་ གཞོལ་བ་ ཉིད་ ནི་ འདི་ ཡིན་ ཏེ །_ |#| འདི་ ལྟ་སྟེ །_ སྦྱིན་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ ཚུལ་ཁྲིམས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ བཟོད་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ བརྩོན་འགྲུས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ བསམ་གཏན་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ མངོན་པར་ བསྒྲུབ་པ འོ །_།
en: Śāradvatī­putra, this gradual deepening consists of accomplishment of the perfection of generosity, the perfection of discipline, the perfection of patience, the perfection of diligence, and the perfection of concentration.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ །_ བྱང་ ཆུབ་ སེམས་དཔ འི་ ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ནི་ ཟབ་པ་ ཉིད་ དུ་ རིག་པ ར་ བྱ འོ །_།
en: Śāradvatī­putra, its very depths should be understood as the bodhisattva’s perfection of insight.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཀྱི་ ཐབས་ ལ་ མཁས་པ་ མངོན་པར་ སྒྲུབ་པ་ ནི་ མཐའ་ཡས་པ་ ཉིད་ དུ་ བལྟ་བ ར་ བྱ་ སྟེ །_
en: Śāradvatī­putra, its infiniteness should be regarded as the bodhisattva’s accomplishment of skill in means regarding the qualities of the buddhas. |#| Thus,

source: གཟོད་མ་ ཉིད་ ནས །_ ཡང་དག་ པ འི་ མཐའ་ མངོན་དུ་ བྱས་པ ས །_ མི་ གནོན་པ ར་ གྱུར་པ་ དང་ །_ སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ མི་ འཇུག་པ ར་ གྱུར་པ་ དང་ །_ ཆོས་ དཀོན་མཆོག་ འདོད་པ་ རྣམས་ མི་ འཇུག་པ ར་ གྱུར་ ན |#| མི་ རུང་ ངོ་ སྙམ་ ནས་ རིམ་གྱིས་ གཞོལ་ ཞིང་ །_ བབ་པ ར་ འཇུག་པ་ དེ་ཉིད་ ཀྱིས་ ཀྱང་ །_ དམིགས་པ་ ཐམས་ཅད་ སྒྱུར་བ ར་ བྱེད་ དོ །_།
en: since the limit of reality is manifest from the very beginning, it would be improper were it not to be traversed, and were immeasurable, countless beings and those who want the jewels of the Dharma not to access it. |#| Thinking this, one can transform one’s entire perspective through embarking on the descent, gradually deepening into it.

source: གཟོད་མ་ ཉིད་ ནས་ འགྲོ་བ་ ཐམས་ཅད་ ཀྱི་ རྒྱ་ ཉིད་ དུ་ རབ་ཏུ་ གནས་ སོ །_།
en: it is steadfast from the very beginning as the very home of all beings within it.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ ཀྱི་ སེམས་ བསྐྱེད་པ་ རབ་ཏུ་ གནས་པ་ ན །_
en: Likewise, Śāradvatī­putra, when the engendered mind of awakening is steadfast,

source: གཟོད་མ་ ཉིད་ ནས་ རིན་པོ་ཆེ འི་ གླིང་ རྒྱུན་ མི་འཆད་པ་ ཉིད་ དུ་ རབ་ཏུ་ གནས་ སོ །_།
en: the island of gems is perpetually steadfast from the very beginning.

source: ཤ་ར་དྭ་ ཏི འི་ བུ །_ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སེམས་བསྐྱེད་པ་ རབ་ཏུ་ གནས་པ་ ན །_
en: Śāradvatī­putra, likewise, when the mind of awakening engendered by the bodhisattva is steadfast,

source: གཟོད་མ་ ཉིད་ ནས་ དྲན་པ་ ཉེ་བ ར་ གཞག་པ་ དང་ །_ ཡང་དག་ པར་ སྤོང་བ་ དང་ །_ རྫུ་འཕྲུལ་ གྱི་ རྐང་པ་ དང་ །_ དབང་པོ་ དང་ །_ སྟོབས་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ །_ བསམ་ [163a] གཏན་ དང་ །_ རྣམ་པར་ ཐར་པ་ དང་ །_ ཏིང་ངེ་འཛིན་ དང་ །_ སྙོམས་པ ར་ འཇུག་པ་ རིན་པོ་ཆེ་ དག་ རབ་ཏུ་ གནས་པ ར་ བྱེད་ དོ །_།
en: this enables the gems of the applications of mindfulness, the authentic eliminations, the bases of supernatural power, the masteries, the powers, the branches of awakening, the concentrations, [163.a] the liberations , the absorptions, and the attainments to be steadfast.”

source: བཅོམ་ལྡན་འདས་ འདི་ལྟ་སྟེ །_ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀྱིས་ རྒྱ་མཚོ་ ཆེན་པོ འི་ དཔེ་ རབ་ཏུ་ བཞག་པ་ དང་ །_ སྤོབས་པ་ དཔག་ ཏུ་ མ་ མཆིས་པ་ མངོན་པར་ སྒྲུབ་པ འི་ ཚུལ་ གྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ཀྱི་ སེམས་ རབ་ཏུ་ བཞག་པ་ ནི་ ངོ་མཚར་ ལགས་སོ །_།
en: “Blessed One, this explanation of the bodhisattvas’ mind of awakening, which the Thus-Gone One, the Worthy One, the perfect Buddha has delivered is amazing! |#| It is amazing how it was presented with such immeasurable eloquence along with analogies to the ocean!”

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ ས་ དཔེ་ཙམ་ ཞིག་ མཛད་པ འོ །_།
en: “Śāradvatī­putra, the Thus-Gone One has provided what is a mere simile.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སེམས་བསྐྱེད་པ་ ནི །_ རྒྱ་མཚོ་ ཆེན་པོ འི་ དཔེ འི་ ཚད་མ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, the mind of awakening engendered by bodhisattvas is not fully measured by the simile of the great ocean.
